Revit 2027 API
ComboBox.AddItems Method
Adds a new items to the ComboBox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ComboBoxMember> AddItems(
	IList<ComboBoxMemberData> memberData
)
Public Function AddItems (
	memberData As IList(Of ComboBoxMemberData)
) As IList(Of ComboBoxMember)
public:
IList<ComboBoxMember^>^ AddItems(
	IList<ComboBoxMemberData^>^ memberData
)
member AddItems :
        memberData : IList<ComboBoxMemberData> -> IList<ComboBoxMember>
Parameters
memberData IList<ComboBoxMemberData>
An object list containing the data needed to construct the ComboBoxMember.
Return Value
IList<ComboBoxMember>
 The newly added ComboBoxMembers.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when memberData is null.
ArgumentException |  Thrown when button with memberData.Name already exists in the drop-down list.
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace